Revit 2022 API
AnalyticalModelSupport.GetSupportType Method
 Gets the type of support provided.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2011
Syntax
C#
public AnalyticalSupportType GetSupportType()
Visual Basic
Public Function GetSupportType As AnalyticalSupportType
Visual C++
public:
AnalyticalSupportType GetSupportType()
Return Value
 Indicates type of support provided.
See Also
AnalyticalModelSupport Class
Autodesk.Revit.DB.Structure Namespace